# Анализ продаж компьютерных игр: выявление закономерностей

## Задача
Интернет-магазину «Стримчик», который продаёт по всему миру видеоигры, необходимо выявить закономерности, которые определяют успешность игр, чтобы выбрать потенциально популярные продукты и разработать эффективные рекламные кампании. Из открытых источников нам доступны исторические данные о продажах игр, оценки пользователей и экспертов, жанры и платформы.

## План
Для начала изучим полученный датафрейм, познакомимся с данными, и совершим предобработку данных. Далее проведем исследовательский анализ для выявления критериев успешности видеоигр и закрепим статистическим тестом.

## Данные
- Название игры,
- платформа,
- год выпуска,
- жанр игры,
- продажи в Северной Америке,
- продажи в Европе,
- продажи в Японии,
- продажи в других странах,
- оценка критиков,
- оценка пользователей,
- рейтинг от организации ESRB.

## Используемые библиотеки
- *pandas*
- *re*
- *matplotlib*
- *seaborn*
- *scipy.stats*
